src/Documents/УстановкаКурсовВалют/УстановкаКурсовВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаКурсовВалют</name>
  <registerRecords>InformationRegister.Валюты</registerRecords>
  <tabularSections>
    <name>Курс</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюта</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Валюты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/УстановкаКурсовВалют/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Валюты
	Движения.Валюты.Записывать = Истина;
	Для Каждого ТекСтрокаКурс Из Курс Цикл
		Движение = Движения.Валюты.Добавить();
		Движение.Период = Дата;
		Движение.Валюта = ТекСтрокаКурс.Валюта;
		Движение.Курс = ТекСтрокаКурс.Курс;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
